# 9.	现有一产品1日~31日的销售额如下：123,226,136,178,124,167,183,194,119,135,189,125,173,193,143,226,201,200,211,226,132,163,225,129,150,151,226,177,189,134,222
# 请找出最大销量以及销售日输出。请用列表推导式完成。

sales = [123, 226, 136, 178, 124, 167, 183, 194, 119, 135, 189, 125, 173, 193, 143, 226, 201, 200, 211, 226, 132, 163, 225, 129, 150, 151, 226, 177, 189, 134, 222]
max_sales = max(sales)  # 找到最大的销售额
max_sales_day = [day for day, sale in enumerate(sales, start=1) if sale == max_sales]  # 找到最大销售额对应的日期
print(f"最大销量是 {max_sales}，销售日是 {max_sales_day}")
